apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

# The XIAO ESP32-S3 Plus carries 16 MB of flash, against the classic hub's 4 and
# the plain/Sense XIAO's 8. Nothing here needs it -- the app is far under 8 MB
# and the partition table is SINGLE_APP -- so this line is about the image header
# describing the part it is on rather than about capacity. An 8 MB setting on a
# 16 MB board boots and runs; it just understates the flash and caps anything
# later that wants a bigger app partition.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# QIO, up from the DIO this build inherited from the classic hub.
#
# The application is mapped from flash and pulled through the instruction cache
# a line at a time -- 32 bytes here -- so every cache miss is a burst read whose
# cost is set by how many data lines the flash uses. DIO drives two (IO0, IO1)
# for address and data alike; QIO drives four, adding IO2 and IO3, which on a
# plain part are the WP and HOLD signals and get repurposed as data lines. At
# the 80 MHz this board clocks flash, that is ~20 MB/s against ~40.
#
# It does not reduce how OFTEN the cache misses -- the 32 kB cache setting
# further down does that -- it halves what each miss costs. The two are worth
# having together: fewer misses, and cheaper ones.
#
# Octal is not available here and never will be: it needs eight data lines and
# a module built for them, and CONFIG_ESPTOOLPY_OCT_FLASH is unset because this
# board's flash is quad -- 16 MB of it on the Plus, and still quad. (The 8 MB of
# PSRAM on the XIAO IS octal, which is where GPIO 33-37 go -- see the note at the
# end of this file.) So QIO at 80 MHz STR is this board's ceiling.
#
# DO NOT "FIX" THE `dio` YOU WILL SEE WHEN FLASHING. `idf.py flash` prints
# `--flash-mode dio` and build/flash_args says the same, with this set to QIO.
# That is correct and deliberate -- IDF's own Kconfig says so:
#
#     # Note: we use esptool to flash bootloader in
#     # dio mode for QIO/QOUT, bootloader then upgrades
#     # itself to quad mode during initialisation
#     config ESPTOOLPY_FLASHMODE
#         default "dio" if ESPTOOLPY_FLASHMODE_QIO
#
# The image header has to be readable by the ROM before any of our code runs, so
# it is stamped DIO; the second-stage bootloader raises the flash to quad during
# init. CONFIG_ESPTOOLPY_FLASHMODE_QIO in sdkconfig.h is the setting that is
# actually in force. Reading the flasher output as "it did not apply" and
# reverting this is the obvious wrong move, which is why this paragraph is here.
#
# Flash it with a full `idf.py flash`, not `app-flash`: the bootloader is the
# part that performs the upgrade, so a stale one leaves the app in DIO.
#
# If the board does not come up, the chip is not damaged and the ROM downloader
# is in silicon: hold BOOT, tap RESET to force download mode, set this back to
# DIO and reflash.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# The console is a WIRE, not the USB connector, and that is the whole point.
#
# This board has no USB-UART bridge: the S3's USB peripheral is wired straight to
# the connector, so the obvious console is ESP_CONSOLE_USB_SERIAL_JTAG and that
# is what this build used to be. The cost of that only became visible late.
#
# SOC_WIFI_PHY_NEEDS_USB_WORKAROUND is set on this part -- the USB and WiFi PHYs
# interfere -- and IDF's fix is blunt: on affected targets the PHY library
# DISABLES the USB PHY when WiFi initialises, to get best WiFi performance.
# ESP_PHY_ENABLE_USB overrides that fix and keeps USB powered, and it defaults to
# y whenever the console is USB Serial/JTAG. components/esp_phy/Kconfig says what
# that costs in plain words: "the USB PHY can interfere with WiFi thus lowering
# WiFi performance ... this option can be disabled to increase WiFi performance".
#
# So a USB console means running this unit's radio with IDF's own mitigation
# switched off, permanently, on the one board in this project whose measured
# problem was the transmit path. The classic hub never had the question: its
# console goes through a separate bridge chip and its radio never sees USB.
#
# UART0 TX on GPIO 43 -- pad D6, the one silkscreened TX, and free in the pin map
# below. RX is -1, meaning no pin at all: GPIO 44 is already the SBC link and a
# log needs no input. D2 (GPIO 3) and D5 (GPIO 6) are still spare if a REPL is
# ever wanted. UART0 for the console against UART_NUM_1 for SBC, so the two
# peripherals do not collide either.
#
# 921600 baud, not the 115200 default, because logging is on the critical path in
# this firmware and has already caused one fault on the satellite: an ESP_LOGW
# per lost packet from the receive task, ~5 ms of blocking UART per line at
# 115200, feeding back into more loss. Drop this if an adapter cannot keep up --
# garbage on the console is the only symptom and it costs a rebuild.
#
# SECONDARY_NONE is load-bearing. The ESP_CONSOLE_SECONDARY choice defaults to
# USB_SERIAL_JTAG the moment the primary console is not USB, which would quietly
# pull the USB PHY back in and undo all of the above. So must ESP_PHY_ENABLE_USB
# be set explicitly: its default is `y if IDF_TARGET_ESP32S3` regardless of what
# the console is doing.
#
# WHAT THIS COSTS AT THE BENCH. The USB PHY is down from the moment WiFi starts,
# so the port vanishes a few hundred ms into boot and esptool cannot reset the
# board into download mode by itself. Flashing now means holding BOOT and tapping
# RESET first, every time. Wire the adapter as: adapter RX <- GPIO 43 (D6),
# adapter GND <- board GND. Nothing else.
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=43
CONFIG_ESP_CONSOLE_UART_RX_GPIO=-1
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_PHY_ENABLE_USB=n

# The radio settles back where the classic hub has it, and the record of why is
# worth more than the two lines it takes to say it.
#
# THE FAULT. A satellite joining a playing stream measured 1016 sendto()
# rejections in one 20 s window -- the `tx-fail` figure on the status line --
# with a previous session in the same log peaking at 1653. The satellite saw
# the other side as ~85% packet loss, phase reaching +1.25 s, and eighteen
# re-anchors in three seconds. alloc-fail stayed 0 throughout, so this was never
# the heap: it is the WiFi driver's transmit path refusing work it has not put
# on the air yet. The IDF's own help for ESP_WIFI_DYNAMIC_TX_BUFFER_NUM
# describes it exactly -- "especially UDP applications, the upper layer can
# deliver frames faster than WiFi layer can transmit".
#
# THE WRONG FIX, which was tried and is recorded here because it looked right.
# Turning aggregation on and unpinning the rate removed the storm completely:
# tx-fail went to 152 once and then zero across twelve consecutive windows, and
# the satellite anchored once instead of eighteen times. It also made the
# STEADY STATE worse by more than an order of magnitude. Satellite gaps per
# minute, from the logs:
#
#   6 Mbps pinned, settled ....... 0.33   (1 gap in 180 s)
#   adaptation + AMPDU ........... 3.5 to 14
#
# The reason is margin. 6 Mbps is the most robust OFDM rate there is; rate
# adaptation at rssi -24 climbs to the top of the MCS range, where a brief
# interferer costs frames that 6 Mbps would have survived. A fixed 24 Mbps was
# tried far earlier in this project and measured 23% loss (see the comment on
# esp_wifi_internal_set_fix_rate in main/streamer.c), which is the same effect
# further along.
#
# WHAT WAS ACTUALLY WRONG. tx-fail in the 6 Mbps run decayed to 0 and stayed
# there for the rest of the session. The transmit path was never broken -- it
# was broken for the first minute of a stream, on the step from idle to ~135
# datagrams a second, and 10% airtime does not saturate anything. That is a
# BUFFER COUNT problem, not a rate problem, and it is fixed below where it
# lives rather than by trading away the robustness that was working.
#
# So: aggregation off was the verdict then (esp_wifi_internal_set_fix_rate
# refuses to run with it on), the rate pinned, and the burst absorbed by TX
# buffers. That was the right call for *reliability at small N*. It is now
# RE-OPENED because the goal moved to satellite COUNT: unicast fan-out makes
# downlink airtime scale with N, and at 6 Mbps the duty-cycle wall lands around
# 6-8 satellites (the table below is where that became visible). A-MPDU
# amortises the ~350 us per-frame DIFS/backoff/preamble across a burst and lets
# rate adaptation reach MCS7 (~65 Mbps), buying roughly 10x airtime headroom.
# Aggregation requires the rate unpinned (the constraint above), so the two
# flips below go together; the satellite needs no rebuild -- AMPDU RX is on
# (RX_BA_WIN 6) and it accepted aggregates when this was tried before, the run
# where tx-fail went 1016 -> 0 (see THE WRONG FIX above).
#
# Steady-state cost on the OLD hardware: 0.33 -> 3.5-14 gaps/min (table below).
# That number was taken with a 16 kB I-cache and the USB-PHY mitigation off;
# both have since flipped (32 kB cache below, ESP_PHY_ENABLE_USB=n). Re-measured
# on this hardware: 0 audio gaps/min over 18 min at 1 satellite, tx-fail 0, hub
# min heap ~68 kB -- clears the ~2.5 gaps/min bar that the old number failed, so
# the flip holds. Scaling to more satellites is still unmeasured (the airtime
# model predicts ~30 at light aggregation); the satellite also logged 17 brief
# STA re-associations that the play buffer absorbed without an audio gap.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6

# The rate axis. All four points were measured on this hardware and 6 Mbps was
# the one that held, 0.33 gaps/min; "do not re-open without a new reason" was
# the standing instruction. The new reason is scaling satellite count (see the
# AMPDU block above), so the rate is unpinned to 0 below and the table stands
# as the record on the OLD hardware.
#
#   rate            satellite gaps            note
#   ----            --------------            ----
#   6 Mbps          5 in 245 s (1.2/min)      this line
#   12 Mbps         241 by 125 s (~115/min)   ~50x worse than 6
#   24 Mbps         23% loss                  measured far earlier in the project
#   0 (adaptive)    3.5 to 14/min             plus AMPDU, see the block above
#
# The 12 Mbps run also ran phase to +221 ms and had the visualiser rendering
# 1762 frames late in one window. It was tried on a specific and reasonable
# theory -- that the startup transient is airtime-bound, so halving the air time
# per frame should shorten it -- and that theory is now dead. Whatever the
# transient is, it is not something a faster pinned rate improves, and every
# step away from 6 Mbps costs far more in steady-state margin than it returns.
#
# What remains unfixed, and is NOT a rate problem: 64 TX buffers cut the startup
# transient about fourfold (tx-fail 1016 -> 251, then 78, then zero) but did not
# end it. A satellite joining during what is left can find 203 CONSECUTIVE
# packets already past their play_at, exhaust its five-second anchor window, and
# have to anchor at -64 ms lead -- costing phase +62 ms and seven retunes over
# ~180 s. The satellite side handles that exactly as designed and can do nothing
# better, because there is no anchorable packet to be had.
#
# The next lever for that is buffers against heap, which on this unit is already
# at a 34.7 kB minimum with a 31.7 kB largest block. That is a real constraint,
# not a free knob.
#
# Rate unpinned (0 = adaptation), paired with the AMPDU flip above. The 3.5-14
# gaps/min in the table is the stale number; on this hardware it re-measures at
# 0 gaps/min at 1 satellite (see the AMPDU block), so the flip holds.
CONFIG_DANCEFLOOR_WIFI_PHY_RATE_MBPS=0

# 240 MHz, up from the 160 that IDF defaults to and that this build inherited
# without anyone choosing it.
#
# Set alongside the cache line below because they answer the same question, and
# the question was a good one: why does the S3 hub perform the same as or worse
# than the classic ESP32 it replaced?
#
# The honest accounting, which is worth writing down because the intuition is
# so strongly the other way. Against the classic part the S3 offers: a higher
# maximum clock (was not enabled -- this line), 512 kB of SRAM against 320
# (nothing here asked for it; it went to the heap), PSRAM (deliberately off, and
# correctly -- see the note at the end of this file), an LX7 with SIMD (ACTIVE,
# via esp-dsp, and the one advantage this build was already collecting), a USB
# peripheral (a liability here: SOC_WIFI_PHY_NEEDS_USB_WORKAROUND is set on this
# part and the console runs on it), and the same class of WiFi radio -- 2.4 GHz
# only, b/g/n, single spatial stream, MCS7 ceiling. There was never a radio
# upgrade to collect, which matters because the radio is what looked broken.
#
# One usable advantage, already on. Everything else disabled by default, unused,
# declined on purpose, or nonexistent -- plus one DISADVANTAGE taken by default
# in the cache. "Same or worse" was the expected result, not an anomaly, and the
# fix is to enable the things that were never enabled rather than to keep
# looking for a fault.
#
# Costs power and heat, and it moves timing everywhere. Read analysis mean/max
# on the vis cost line and tx-fail on the status line after changing it.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 32 KB of instruction cache, and this is the line that should never have needed
# writing. It is the best current candidate for why an S3 hub struggles at a job
# the classic hub has done for months.
#
# The ESP32-S3 can run 16 or 32 kB of I-cache and IDF defaults to 16. The classic
# ESP32 HAS NO SUCH SETTING -- components/esp_system/port/soc/esp32/ contains no
# Kconfig.cache at all, because its cache is fixed. So when this project was
# retargeted, there was nothing in the classic hub's config to inherit: the
# symbol appeared for the first time and silently took IDF's default, and this
# unit has been running half the instruction cache of the one it was copied
# from, ever since.
#
# That is the trap worth remembering, more than the setting. "The configuration
# started the same as the classic ESP32" is TRUE and is exactly the reason: a
# symbol that exists only on the new target cannot be inherited from the old
# one, and no diff of the tracked files will ever show it. It is the same shape
# as the LED pattern note below, which cost a false sync-fault reading.
#
# Why it should matter here specifically: this unit runs the FFT analysis, SBC
# decode, LED rendering and the WiFi driver, all out of flash through that
# cache, and a miss stalls the CPU on a SPI fetch. If those stalls land in the
# transmit path, TX buffers do not drain and sendto() starts refusing -- which
# is the fault. Corroborating evidence already in the logs: this is an LX7 with
# SIMD esp-dsp and should beat the classic hub's LX6 at the FFT, yet it reports
# analysis 3900/21000 us mean/max against an 11.6 ms frame period. A max of
# nearly two frame periods on the FASTER chip is not compute.
#
# Partly offset by flash at 80 MHz here against the classic hub's 40, which
# makes each miss cheaper. Evidently not enough.
#
# Costs 16 kB of heap: the unused half is given to the allocator at 16 kB, and
# is not at 32. Paid for by the line below.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Back to the IDF default of 32, from 64, and deliberately.
#
# 64 was the right guess when the transient looked like a buffer shortage: it
# cut tx-fail from 1016 to 251, then 78. But it never ended the transient, and
# it costs the heap this unit no longer has spare once the cache above takes its
# 16 kB back -- the minimum was already 34.7 kB with a 31.7 kB largest block.
#
# Returning it also makes the cache change a SINGLE-VARIABLE experiment. 32
# buffers with a 16 kB cache is exactly the configuration that measured tx-fail
# 1016; if 32 buffers with a 32 kB cache measures near zero, the cache was the
# cause and the buffer count never was. If the storm comes back, the cache is
# not the answer and 64 should return.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

